---
kind: method
id: M:Autodesk.Revit.DB.LinearArray.GetOriginalMemberIds
source: html/99315d93-cf2a-8619-49de-0864a5b742cc.htm
---
# Autodesk.Revit.DB.LinearArray.GetOriginalMemberIds Method

Retrieves the original member Ids of the Array.

## Syntax (C#)
```csharp
public override ICollection<ElementId> GetOriginalMemberIds()
```

## Returns
The original member Ids of the Array